---
title: jq用法
tags: ["linux", "jq", "linux", "shell"]
date: 2025-06-20T10:23:56.06+0800
---

*** jq 对数组的操作
  加法（+）用于数组合并：
  #+BEGIN_SRC bash
  echo '[1,2] [3,4]' | jq -s '.[0] + .[1]'
  #+END_SRC
  #+RESULTS:
  : [1,2,3,4]

*** jq 对数字的操作
  加法（+）用于数值相加：
  #+BEGIN_SRC bash
  echo '1 2' | jq -s '.[0] + .[1]'
  #+END_SRC
  #+RESULTS:
  : 3

*** jq 对对象的操作
  对象合并时，相同 key 的值会被后面的对象覆盖：
  #+BEGIN_SRC bash
  echo '{"a":1, "b":2} {"b":21, "c":3}' | jq -s '.[0] + .[1]'
  #+END_SRC
  #+RESULTS:
  #+BEGIN_EXAMPLE
  {
    "a": 1,
    "b": 21,
    "c": 3
  }
  #+END_EXAMPLE

*** 演示：向数组中追加元素（不修改原文件）
  使用 ~+=~ 操作符向 ~add_menu~ 追加新对象：
  #+BEGIN_SRC bash
  jq '.add_menu += [{"data-root": "/data/disk/cache"}]' add.json
  #+END_SRC
  #+RESULTS:
  #+BEGIN_EXAMPLE
  {
    "add_menu": [
      { "command": "go.explorer.refresh", "when": "false" },
      { "command": "go.explorer.open", "when": "false" },
      { "data-root": "/data/disk/cache" }
    ]
  }
  #+END_EXAMPLE

